AccumulationRegisters/МатериалыВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>МатериалыВЭксплуатации</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеБригады</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/МатериалыВЭксплуатации/Ext/RecordSetModule.bsl
Функция ПолучитьЦенуОстаткаНоменклатуры(Знач ДатаОстатков, Знач Организация, Знач Ответсвенный, Знач Номенклатура, Знач ХарактеристикаНоменклатуры, Знач СерияНоменклатуры) Экспорт
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток,
	|	СУММА(ТоварыНаСкладахОстатки.СуммаОстаток) КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.МатериалыВЭксплуатации.Остатки(
	|			&ДатаОстатков,
	|			Организация = &Организация
	|				И Ответственный = &Ответственный
	|				И Номенклатура = &Номенклатура
	|				И ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры
	|				И СерияНоменклатуры = &СерияНоменклатуры) КАК ТоварыНаСкладахОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыНаСкладахОстатки.Номенклатура";
	
	Запрос.УстановитьПараметр("ДатаОстатков",ДатаОстатков);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Ответственный",Ответсвенный);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("СерияНоменклатуры",СерияНоменклатуры);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.КоличествоОстаток = 0 Тогда
			Результат = Выборка.СуммаОстаток / Выборка.КоличествоОстаток; 
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

//контроль остатков по регистру
//параметры:
//Документ - ДокументСсылка - ссылка на документ-регистратор
//Ответсвенный - Справочник.Сотрудники, Справочник.Бригады, Справочник.ПроизводственныеБригады - ответсвенный,на котором проверяется остаток
//ТаблицаТовары - ТаблицаЗначений - товары, которые нужно списывать. Колонки:
//										- Номенклатура - Справочник.Номенклатура
//										- Количество - число
//ДатаДвижения - Дата на которую осуществляется движение - если не задана, будет использована дата документа
//
//Возвращает:
//истина 	- контроль остатков пройден, товар списан
//ложь 		- контроль остатков не пройден либо вызвана ошибка
Функция КонтрольОстатков(Знач Документ, Знач Организация, Знач Ответственный, Знач ТаблицаТовары, Знач ДатаДвижения = Неопределено) Экспорт
	
	Результат = Истина;
	
	Если (ДатаДвижения = Неопределено) или (ДатаДвижения = Дата(1,1,1)) Тогда
		ДатаДвижения = Документ.Дата;
	КонецЕсли;
	
	ВремТаблицаТовары = Новый ТаблицаЗначений;
	ВремТаблицаТовары.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ВремТаблицаТовары.Колонки.Добавить("ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ВремТаблицаТовары.Колонки.Добавить("СерияНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ВремТаблицаТовары.Колонки.Добавить("Количество",Новый ОписаниеТипов("число"));
	ВремТаблицаТовары.Колонки.Добавить("Коэффициент",Новый ОписаниеТипов("число"));
	Для Каждого ТекущаяСтрока Из ТаблицаТовары Цикл
		//++ #12079
		//Если НЕ ТекущаяСтрока.Номенклатура = Справочники.Номенклатура.ОстаткиПленки
		//	И НЕ ТекущаяСтрока.Номенклатура = Справочники.Номенклатура.МатериалЗаказчика Тогда
		Если НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.ОстатокПленки
			//++ #14311
			//И НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.МатериалЗаказчика Тогда
			И НЕ ТекущаяСтрока.Номенклатура.МатериалЗаказчика Тогда
			//-- #14311
		//-- #12079
			НоваяСтрока = ВремТаблицаТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	ВременныеТаблицы = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = ВременныеТаблицы;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ТаблицаТовары.Номенклатура,
	               |	ТаблицаТовары.ХарактеристикаНоменклатуры,
	               |	ТаблицаТовары.СерияНоменклатуры,
	               |	ТаблицаТовары.Количество,
	               |	ТаблицаТовары.Коэффициент
	               |ПОМЕСТИТЬ ТаблицаТовары
	               |ИЗ
	               |	&ТаблицаТовары КАК ТаблицаТовары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДокСписания.Номенклатура,
	               |	ДокСписания.ХарактеристикаНоменклатуры,
	               |	ДокСписания.СерияНоменклатуры,
	               |	ЕСТЬNULL(СУММА(ДокСписания.Количество * ДокСписания.Коэффициент), 0) КАК Количество,
	               |	ЕСТЬNULL(СУММА(Остатки.КоличествоОстаток), 0) КАК КоличествоОстаток
	               |ИЗ
	               |	ТаблицаТовары КАК ДокСписания
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.МатериалыВЭксплуатации.Остатки(
	               |				&ТекДата,	               
	               |					Ответственный = &Ответственный
				   |					И ВЫБОР
				   |						КОГДА &ОбщиеСклады ТОГДА ИСТИНА
				   |					ИНАЧЕ Организация = &Организация КОНЕЦ
	               |					И Номенклатура В
	               |						(ВЫБРАТЬ
	               |							ДокСписания.Номенклатура
	               |						ИЗ
	               |							ТаблицаТовары КАК ДокСписания)
	               |					И ХарактеристикаНоменклатуры В
	               |						(ВЫБРАТЬ
	               |							ДокСписания.ХарактеристикаНоменклатуры
	               |						ИЗ
	               |							ТаблицаТовары КАК ДокСписания)
	               |					И СерияНоменклатуры В
	               |						(ВЫБРАТЬ
	               |							ДокСписания.СерияНоменклатуры
	               |						ИЗ
	               |							ТаблицаТовары КАК ДокСписания)) КАК Остатки
	               |		ПО (Остатки.Номенклатура = ДокСписания.Номенклатура)
	               |			И (Остатки.ХарактеристикаНоменклатуры = ДокСписания.ХарактеристикаНоменклатуры)
	               |			И (Остатки.СерияНоменклатуры = ДокСписания.СерияНоменклатуры)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДокСписания.Номенклатура,
	               |	ДокСписания.ХарактеристикаНоменклатуры,
	               |	ДокСписания.СерияНоменклатуры";
	
	Запрос.УстановитьПараметр("ДокументСписания",Документ);
	Запрос.УстановитьПараметр("ТекДата",ДатаДвижения);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Ответственный",Ответственный);
	Запрос.УстановитьПараметр("ТаблицаТовары",ВремТаблицаТовары);
	Запрос.УстановитьПараметр("ОбщиеСклады", Константы.ОбщиеСклады.Получить());
	
	ВыборкаСписание = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСписание.Следующий() Цикл
		Если ВыборкаСписание.КоличествоОстаток < ВыборкаСписание.Количество Тогда
			Сообщить("Возвращается " + ВыборкаСписание.Номенклатура + ", Характеристика: " + ВыборкаСписание.ХарактеристикаНоменклатуры + ", Серия: " + ВыборкаСписание.СерияНоменклатуры + " в количестве = " + ВыборкаСписание.Количество + ", остаток в эксплуатации = " + ВыборкаСписание.КоличествоОстаток,СтатусСообщения.Важное);
			Результат = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции
